IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l11xx_l13xx/TIMG2_1.0.xml
        <register id="TIMG2_CC_01" width="32" offset="0x10" instances="2" instaddr="0x4" description="Capture or Compare Register 0 to Capture or Compare Register 1">
            <bitfield id="CCVAL" description="Capture or compare value" begin="15" end="0" width="16" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFFFF" description="Maximum Value"/>
            </bitfield>
        </register>
        <register id="TIMG2_CCCTL_01" width="32" offset="0x30" instances="2" instaddr="0x4" description="Capture or Compare Control Registers">
            <bitfield id="CCOND" description="Capture Condition. #br# Specifies the condition that generates a capture pulse. 4h-Fh = Reserved" begin="2" end="0" width="3" rwaccess="R/W">
                <bitenum id="NOCAPTURE" value="0x0" description="None (never captures)"/>
                <bitenum id="CC_TRIG_RISE" value="0x1" description="Rising edge of CCP or trigger assertion edge"/>
                <bitenum id="CC_TRIG_FALL" value="0x2" description="Falling edge of CCP or trigger de-assertion edge"/>
                <bitenum id="CC_TRIG_EDGE" value="0x3" description="Either edge of CCP or trigger change (assertion/de-assertion edge)"/>
            </bitfield>
            <bitfield id="ACOND" description="Advance Condition. #br# Specifies the condition that generates an advance pulse. 6h-Fh = Reserved" begin="6" end="4" width="3" rwaccess="R/W">
                <bitenum id="TIMCLK" value="0x0" description="Each TIMCLK"/>
                <bitenum id="CC_TRIG_RISE" value="0x1" description="Rising edge of CCP or trigger assertion edge"/>
                <bitenum id="CC_TRIG_FALL" value="0x2" description="Falling edge of CCP or trigger de-assertion edge"/>
                <bitenum id="CC_TRIG_EDGE" value="0x3" description="Either edge of CCP or trigger change (assertion/de-assertion edge)"/>
                <bitenum id="CC_TRIG_HIGH" value="0x5" description="CCP High or Trigger assertion (level)"/>
            </bitfield>
            <bitfield id="LCOND" description="Load Condition. #br# Specifies the condition that generates a load pulse.  4h-Fh = Reserved" begin="10" end="8" width="3" rwaccess="R/W">
                <bitenum id="CC_TRIG_RISE" value="0x1" description="Rising edge of CCP or trigger assertion edge"/>
                <bitenum id="CC_TRIG_FALL" value="0x2" description="Falling edge of CCP or trigger de-assertion edge"/>
                <bitenum id="CC_TRIG_EDGE" value="0x3" description="Either edge of CCP or trigger change (assertion/de-assertion edge)"/>
            </bitfield>
            <bitfield id="ZCOND" description="Zero Condition. #br# This field specifies the condition that generates a zero pulse. 4h-Fh = Reserved" begin="14" end="12" width="3" rwaccess="R/W">
                <bitenum id="CC_TRIG_RISE" value="0x1" description="Rising edge of CCP or trigger assertion edge"/>
                <bitenum id="CC_TRIG_FALL" value="0x2" description="Falling edge of CCP or trigger de-assertion edge"/>
                <bitenum id="CC_TRIG_EDGE" value="0x3" description="Either edge of CCP or trigger change (assertion/de-assertion edge)"/>
            </bitfield>
            <bitfield id="COC" description="Capture or Compare. #br# Specifies whether the corresponding CC register is used as a capture register or a compare register (never both)." begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="COMPARE" value="0x0" description="Compare"/>
                <bitenum id="CAPTURE" value="0x1" description="Capture"/>
            </bitfield>
            <bitfield id="CCACTUPD" description="CCACT shadow register Update Method
This field controls how updates to the CCCACT shadow register are performed" begin="28" end="26" width="3" rwaccess="R/W">
                <bitenum id="Immediately" value="0x0" description="Value written to the CCACT register has immediate effect."/>
                <bitenum id="Zero_EVT" value="0x1" description="Following a zero event Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals 0."/>
                <bitenum id="Compare_Down_EVT" value="0x2" description="Following a compare (down) event Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals the CCx_y register value."/>
                <bitenum id="Compare_UP_EVT" value="0x3" description="Following a compare (up) event Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals the CCx_y register value."/>
                <bitenum id="ZERO_LOAD_EVT" value="0x4" description="Following a zero or load event Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals 0 or CTR. Equals LDn.  Note this update mechanism is defined for use only in configurations using up/down counting. This mode is not intended for use in down count configurations."/>
                <bitenum id="ZERO_RC_ZERO_EVT" value="0x5" description="Following a zero event with repeat count also zero.  Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals 0 and if RC equal 0."/>
                <bitenum id="TRIG" value="0x6" description="On a TRIG pulse, the value stored in CCACTx_y shadow register is loaded into CCACTx_y active register."/>
            </bitfield>
            <bitfield id="CC2SELU" description="Selects the source second CCU event." begin="24" end="22" width="3" rwaccess="R/W">
                <bitenum id="SEL_CCU0" value="0x0" description="Selects CCU from CC0."/>
                <bitenum id="SEL_CCU1" value="0x1" description="Selects CCU from CC1."/>
                <bitenum id="SEL_CCU2" value="0x2" description="Selects CCU from CC2."/>
                <bitenum id="SEL_CCU3" value="0x3" description="Selects CCU from CC3."/>
                <bitenum id="SEL_CCU4" value="0x4" description="Selects CCU from CC4."/>
                <bitenum id="SEL_CCU5" value="0x5" description="Selects CCU from CC5."/>
            </bitfield>
            <bitfield id="CC2SELD" description="Selects the source second CCD event." begin="31" end="29" width="3" rwaccess="R/W">
                <bitenum id="SEL_CCD0" value="0x0" description="Selects CCD from CC0."/>
                <bitenum id="SEL_CCD1" value="0x1" description="Selects CCD from CC1."/>
                <bitenum id="SEL_CCD2" value="0x2" description="Selects CCD from CC2."/>
                <bitenum id="SEL_CCD3" value="0x3" description="Selects CCD from CC3."/>
                <bitenum id="SEL_CCD4" value="0x4" description="Selects CCD from CC4."/>
                <bitenum id="SEL_CCD5" value="0x5" description="Selects CCD from CC5."/>
            </bitfield>
        </register>
        <register id="TIMG2_OCTL_01" width="32" offset="0x50" instances="2" instaddr="0x4" description="CCP Output Control Registers">
            <bitfield id="CCPOINV" description="CCP Output Invert The output as selected by CCPO is conditionally inverted." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="NOINV" value="0x0" description="No inversion"/>
                <bitenum id="INV" value="0x1" description="Invert"/>
            </bitfield>
            <bitfield id="CCPIV" description="CCP Initial Value This bit specifies the logical value put on the signal generator state while the counter is disabled (CTRCTL.EN == 0)." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="LOW" value="0x0" description="Low"/>
                <bitenum id="HIGH" value="0x1" description="High"/>
            </bitfield>
            <bitfield id="CCPO" description="CCP Output Source" begin="3" end="0" width="4" rwaccess="R/W">
                <bitenum id="FUNCVAL" value="0x0" description="Signal generator value (for example, PWM, triggered PWM)"/>
                <bitenum id="LOAD" value="0x1" description="Load condition"/>
                <bitenum id="CMPVAL" value="0x2" description="Compare value = counter condition"/>
                <bitenum id="ZERO" value="0x4" description="Zero condition"/>
                <bitenum id="CAPCOND" value="0x5" description="Capture condition"/>
                <bitenum id="FAULTCOND" value="0x6" description="Fault Condition"/>
                <bitenum id="CC0_MIRROR_ALL" value="0x8" description="Mirror CCP of first capture and compare register in counter group"/>
                <bitenum id="CC1_MIRROR_ALL" value="0x9" description="Mirror CCP of second capture and compare register in counter group"/>
                <bitenum id="DEADBAND" value="0xC" description="Deadband Inserted Output"/>
                <bitenum id="CNTDIR" value="0xD" description="Counter direction"/>
            </bitfield>
        </register>
        <register id="TIMG2_CCACT_01" width="32" offset="0x70" instances="2" instaddr="0x4" description="Capture or Compare Action Registers">
            <bitfield id="ZACT" description="CCP Output Action on Zero  Specifies what changes occur to CCP output as the result of a zero event." begin="1" end="0" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
            </bitfield>
            <bitfield id="LACT" description="CCP Output Action on Load  Specifies what changes occur to CCP output as the result of a load event." begin="4" end="3" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
            </bitfield>
            <bitfield id="CDACT" description="CCP Output Action on Compare (Down)  This field describes the resulting action of the signal generator upon detecting a compare event while counting down." begin="7" end="6" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
            </bitfield>
            <bitfield id="CUACT" description="CCP Output Action on Compare (Up)  This field describes the resulting action of the signal generator upon detecting a compare event while counting up." begin="10" end="9" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
            </bitfield>
            <bitfield id="CC2DACT" description="CCP Output Action on CC2D event." begin="13" end="12" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
            </bitfield>
            <bitfield id="CC2UACT" description="CCP Output Action on CC2U event." begin="16" end="15" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
            </bitfield>
            <bitfield id="SWFRCACT" description="CCP Output Action on Software Froce Output

This field describes the resulting action of software force.

This action has a shadow register, which will be updated under specific condition. 
So that this register cannot take into effect immediately." begin="29" end="28" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
            </bitfield>
        </register>
        <register id="TIMG2_IFCTL_01" width="32" offset="0x80" instances="2" instaddr="0x4" description="Input Filter Control Register">
            <bitfield id="ISEL" description="Input Select (CCP0)  This field selects the input source to the filter input. 4h-7h = Reserved" begin="3" end="0" width="4" rwaccess="R/W">
                <bitenum id="CCPX_INPUT" value="0x0" description="CCP of the corresponding capture compare unit"/>
                <bitenum id="CCPX_INPUT_PAIR" value="0x1" description="Input pair CCPX of the capture compare unit. For CCP0 input pair is CCP1 and for CCP1 input pair is CCP0."/>
                <bitenum id="CCP0_INPUT" value="0x2" description="CCP0 of the counter"/>
                <bitenum id="TRIG_INPUT" value="0x3" description="Trigger"/>
                <bitenum id="CCP_XOR" value="0x4" description="XOR of CCP inputs as input source."/>
                <bitenum id="FSUB0" value="0x5" description="subscriber 0 event as input source."/>
                <bitenum id="FSUB1" value="0x6" description="subscriber 1 event as input source."/>
                <bitenum id="COMP0" value="0x7" description="Comparator 0 output."/>
                <bitenum id="COMP1" value="0x8" description="Comparator 1 output."/>
                <bitenum id="COMP2" value="0x9" description="Comparator 2 output."/>
            </bitfield>
            <bitfield id="INV" description="Input Inversion This bit controls whether the selected input is inverted." begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="NOINVERT" value="0x0" description="Noninverted"/>
                <bitenum id="INVERT" value="0x1" description="Inverted"/>
            </bitfield>
            <bitfield id="FP" description="Filter Period. This field specifies the sample period for the
input filter. I.e. The input is sampled for FP
timer clocks during filtering." begin="9" end="8" width="2" rwaccess="R/W">
                <bitenum id="_3" value="0x0" description="The division factor is 3"/>
                <bitenum id="_5" value="0x1" description="The division factor is 5"/>
                <bitenum id="_8" value="0x2" description="The division factor is 8"/>
            </bitfield>
            <bitfield id="CPV" description="Consecutive Period/Voting Select

This bit controls whether the input filter uses a
stricter consecutive period count or majority
voting." begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="Consecutive" value="0x0" description="Consecutive Periods The input must be at a specific logic level for the period defined by FP before it is passed to the filter output."/>
                <bitenum id="Voting" value="0x1" description="Voting  The filter ignores one clock of opposite logic over the filter period. I.e. Over FP samples of the input, up to 1 sample may be of an opposite logic value (glitch) without affecting the output."/>
            </bitfield>
            <bitfield id="FE" description="Filter Enable
This bit controls whether the input is filtered by
the input filter or bypasses to the edge
detect." begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Bypass."/>
                <bitenum id="ENABLED" value="0x1" description="Filtered."/>
            </bitfield>
        </register>
        <register id="TIMG2_TSEL" width="32" offset="0xB0" description="Trigger Select">
            <bitfield id="ETSEL" description="External Trigger Select. #br# This selects which System Event is used if the input filter selects trigger.  
Triggers 0-15 are used to connect triggers generated by other timer modules in the same power domain. Refer to the SoC datasheet to get details.
Triggers 16 and  17 are connected to event manager subscriber ports.
Event lines 18-31 are reserved for future use." begin="4" end="0" width="5" rwaccess="R/W">
                <bitenum id="TRIG0" value="0x0" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG1" value="0x1" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG2" value="0x2" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG3" value="0x3" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG4" value="0x4" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG5" value="0x5" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG6" value="0x6" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG7" value="0x7" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG8" value="0x8" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG9" value="0x9" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG10" value="0xA" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG11" value="0xB" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG12" value="0xC" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG13" value="0xD" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG14" value="0xE" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG15" value="0xF" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG_SUB0" value="0x10" description="TRIG_SUBx = External trigger input from subscriber port x."/>
                <bitenum id="TRIG_SUB1" value="0x11" description="TRIG_SUBx = External trigger input from subscriber port x."/>
            </bitfield>
            <bitfield id="TE" description="Trigger Enable.
This selects whether a trigger is enabled or not for this counter  
0x0 = Triggers are not used 
0x1 = Triggers are used as selected by the ETSEL field" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Triggers are not used."/>
                <bitenum id="ENABLED" value="0x1" description="Triggers are used as selected by the IE, ITSEL and ETSEL fields."/>
            </bitfield>
        </register>
    </group>
</module>
